Repository: KDE/kolf
Catalog: po/*/kolf.po
Languages: eo

# NAME OF TRANSLATORS
source: Your names
eo: Axel Rousseau, Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
eo: axel@esperanto-jeunes.org, olivermkellogg@gmail.com

source: No configuration options
eo: Neniuj agordopcioj

# @label:listbox
source: Add object:
eo: Aldoni objekton:

# @label:textbox
source: Course name:
eo: Nomo de golfejo:

# @label:textbox
source: Course author:
eo: Aŭtoro de golfejo:

# @label:spinbox
source: Maximum:
eo: Maksimumo:

# @info:whatsthis
source: Maximum number of strokes player can take on this hole.
eo: Maksimuma nombro da batoj kiun ludanto rajtas uzi por ĉi tiu truo.

# @info:tooltip
source: Maximum number of strokes
eo: Maksimuma nombro de batoj

# @item number of strokes
source: Unlimited
eo: Senlima

# @option:check
source: Show border walls
eo: Montri limomurojn

source: Course Author
eo: Aŭtoro de golfejo

source: Course Name
eo: Nomo de golfejo

# @item harzard action
source: Drop Outside of Hazard
eo: Faligi ekster danĝerejo

# @item harzard action
source: Rehit From Last Location
eo: Rebati ekde lasta loko

source: What would you like to do for your next shot?
eo: Kion vi ŝatus fari por via sekva bato?

# @title:window
source: %1 in a Hazard
eo: %1 en Danĝerejo

source: %1 will start off.
eo: %1 ekkomencos.

# @title:window
source: New Hole
eo: Nova Truo

source: Course name: %1
eo: Golfejnomo: %1

source: Created by %1
eo: Kreita far %1

source: %1 hole
eo: %1 truo

# @title:window
source: Course Information
eo: Informoj pri Golfejo

source: This hole uses the following plugins, which you do not have installed:
eo: Ĉi tiu truo uzas la jenajn kromaĵojn, kiujn vi ne instalis:

source: There are unsaved changes to current hole. Save them?
eo: Estas nekonservitaj ŝanĝoj al nuna truo. Ĉu konservi ilin?

# @title:window
source: Unsaved Changes
eo: Nekonservitaj ŝanĝoj

# @action:button
source: Save &Later
eo: Konservi p&li poste

# @title:window
source: Pick Kolf Course to Save To
eo: Elektu Kolf-ejon al kiu konservi

# @option:check
source: &Do not ask again
eo: Ne &peti denove

source: Slope
eo: Deklivo

source: Puddle
eo: Flako

source: Wall
eo: Muro

source: Cup
eo: Ujo

source: Sand
eo: Sablo

source: Windmill
eo: Ventmuelejo

source: Black Hole
eo: Nigra Truo

source: Floater
eo: Flosanto

source: Bridge
eo: Ponto

source: Sign
eo: Subskribi

source: Bumper
eo: Bumpero

# @action
source: Save &Course
eo: Konservi &Golfejon

# @action
source: Save &Course As…
eo: Konservi Golfejon &Kiel…

# @action
source: &Save Game
eo: Kon&servi Ludon

# @action
source: &Save Game As…
eo: Kon&servi Ludon Kiel…

# @option:check
source: &Edit
eo: &Redakti

# @action
source: &New
eo: &Nova

# @action
source: &Reset
eo: &Reagordu

# @action
source: &Undo Shot
eo: &Malfari Baton

# @title:menu
source: Switch to Hole
eo: Ŝalti al Truo

# @action
source: &Next Hole
eo: &Sekva Truo

# @action
source: &Previous Hole
eo: &Antaŭa Truo

# @action
source: &First Hole
eo: &Unua Truo

# @action
source: &Last Hole
eo: &Lasta Truo

# @action
source: &Random Hole
eo: Haza&rda Truo

# @option:check
source: Enable &Mouse for Moving Putter
eo: Ebligi &Muson por Movi Ludanton

# @option:check
source: Enable &Advanced Putting
eo: Ebligi Progresintan Lud&adon

# @option:check
source: Show &Info
eo: Montri &Informon

# @option:check
source: Show Putter &Guideline
eo: Montri &Gvidlinion por ludantoj

# @option:check
source: Enable All Dialog Boxes
eo: Ebligi Ĉiujn Dialog

# @option:check
source: Play Sounds
eo: Aŭdigi Sonojn

# @action
source: &About Course
eo: Pri l&a Golfejo

# @action
source: &Tutorial
eo: &Lernilo

# @item:intext winners
source: and
eo: kaj

source: %1 tied
eo: %1 nedecidita

source: %1 won!
eo: %1 venkis!

source: High Scores for %1
eo: Altaj Poentoj por %1

# @title:window
source: Pick Saved Game to Save To
eo: Elekti Konservitan Ludon por Konservi Al

# @title:window
source: Pick Kolf Saved Game
eo: Elekti Kolf Konservitan Ludo

source: %1's turn
eo: La vico de %1

source: %1's score has reached the maximum for this hole.
eo: La poentaro de %1 atingis la maksimumon por ĉi tiu truo.

source: Ho&le
eo: Tr&uo

source: &Go
eo: Navi&gi

# @option:check
source: Enable show/hide
eo: Ebligi montri/kaŝi

# @item:inrange
source: Slow
eo: Malrapida

# @item:inrange
source: Fast
eo: Rapida

source: Vertical
eo: Vertikala

source: Horizontal
eo: Horizontala

source: Opposite Diagonal
eo: Kontraŭa Diagonalo

source: Elliptic
eo: Elipsa

# @option:check
source: Reverse direction
eo: Inversa direkto

# @option:check
source: Unmovable
eo: Nemovebla

# @info:whatsthis
source: Whether or not this slope can be moved by other objects, like floaters.
eo: Ĉu aŭ ne ĉi tiu deklivo povas esti movita per aliaj objektoj, kiel flosiloj.

# @lable:spinbox
source: Grade:
eo: Grado:

source: KDE Minigolf Game
eo: KDE-Minigolfludo

source: (c) 2002-2010, Kolf developers
eo: (c) 2002-2010, Kolf-programistoj

source: Current maintainer
eo: Nuna prizorganto

source: Former main author
eo: Iama ĉefa aŭtoro

source: Advanced putting mode
eo: Altnivela metareĝimo

source: Border around course
eo: Limo ĉirkaŭ kurso

source: Some good sound effects
eo: Kelkaj bonaj sonefektoj

source: Wall-bouncing help
eo: Mur-salta helpo

source: Suggestions, bug reports
eo: Sugestoj, cimraportoj

source: Developer of Box2D physics engine
eo: Ellaboranto de Box2D-fizika motoro

source: Vector class (Kolf 1)
eo: Vektora klaso (Kolf 1)

source: Working wall-bouncing algorithm (Kolf 1)
eo: Funkcianta muro-salta algoritmo (Kolf 1)

source: File
eo: Dosiero

source: Print course information and exit
eo: Presi kursajn informojn kaj eliri

source: By %1
eo: De %1

source: %1 holes
eo: %1 truoj

source: Course %1 does not exist.
eo: Kurso %1 ne ekzistas.

# @title:window
source: New Game
eo: Nova Ludo

# @title:tab
source: Players
eo: Ludantoj

# @action:button
source: &New Player
eo: &Nova Ludanto

# @title:tab
source: Course
eo: Kurso

# @title
source: Choose Course to Play
eo: Elekti Kurson por Ludi

# @item
source: <Create New>
eo: <Krei Novan>

source: You
eo: Vi

# @action:button
source: Highscores
eo: Rekordoj

# @action:button
source: Add…
eo: Aldoni…

# @action:button
source: Remove
eo: Forigi

# @title:tab
source: Options
eo: Opcioj

# @title
source: Game Options
eo: Ludaj Opcioj

# @option:check
source: &Strict mode
eo: &Strika reĝimo

source: In strict mode, undo, editing, and switching holes is not allowed. This is generally for competition. Only in strict mode are highscores kept.
eo: En strikta reĝimo, malfari, redakti kaj ŝanĝi truojn ne estas permesitaj. Ĉi tio estas ĝenerale por konkurado. Nur en strikta reĝimo altpoentaroj estas konservitaj.

# @info author attribution
source: By %1
eo: De %1

# @info
source: 1 Hole
eo: %1 Truoj

# @title:window
source: Pick Kolf Course
eo: Elekti Kolf-Kurson

source: Chosen course is already on course list.
eo: Elektita kurso jam estas en kurslisto.

source: Player %1
eo: Ludanto %1

# @item:valuesuffix
source: degree
eo: grado

# @label:spinbox
source: Exiting ball angle:
eo: Eliranta pilka angulo:

# @label:spinbox
source: Minimum exit speed:
eo: Minimuma elirrapideco:

# @label:spinbox
source: Maximum exit speed:
eo: Maksimuma elirrapideco:

# @option:check wall on
source: &Top
eo: &Supre

# @option:check wall on
source: &Left
eo: Ma&ldekstre

# @option:check wall on
source: &Right
eo: Dekst&re

# @option:check wall on
source: &Bottom
eo: &Malsupre

# @label:chooser
source: Walls on:
eo: Muroj sur:

# @label:textbox
source: Sign HTML:
eo: Signo HTML:

# @option:check
source: Windmill on top
eo: Ventmuelejo supre

# @label:slider
source: Moving speed
eo: Rapideco de moviĝo

source: New Text
eo: Nova Teksto

# @title:column
source: Total
eo: Sumo
